xfire-aegis/src/test/org/codehaus/xfire/services/base64/binaryEmpty.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><verifyDataIntegrity xmlns="http://base64.services.xfire.codehaus.org"><data/><length>0</length><crc32>0</crc32></verifyDataIntegrity></soap:Body></soap:Envelope>